In [1]:
import pandas as pd

In [3]:
pd.read_csv('Data/course_offerings.csv')

   course_id                  course_name    instructor
0        101              Intro to Python  Chris Bruehl
1        102                 Intro to SQL   John Pauler
2        201    Exploratory Data Analysis    Alice Zhao
3        301                   Algorithms  Chris Bruehl
4        331  Natural Language Processing    Alice Zhao

In [5]:
pd.read_excel('Data/Course Offerings.xlsx', sheet_name=1)

   Course ID                  Course Name    Instructor
0        101              Intro to Python  Chris Bruehl
1        102                 Intro to SQL   John Pauler
2        201    Exploratory Data Analysis    Alice Zhao
3        301                   Algorithms  Chris Bruehl
4        331  Natural Language Processing    Alice Zhao

# Connecting SQL Database
Connect to a SQLite database

Install a database driver (pip install or conda install)
!pip install mysql-connector-python

Set up the database connection
import sql.connector
conn = mysql.connector.connect(host='localhost',
                                databse='my_new_db',
                                user='user',
                                password='password')

import sqlite3
conn = sqlite3.connect('maven.db')
pd.read_sql('insert query syntax here', conn)

In [6]:
import sqlite3

In [7]:
conn = sqlite3.connect('Data/maven.db')

In [8]:
pd.read_sql('SELECT * FROM courses', conn)

   course_id                       course    instructor
0        101              Intro to Python  Chris Bruehl
1        102                 Intro to SQL   John Pauler
2        201    Exploratory Data Analysis    Alice Zhao
3        301                   Algorithms  Chris Bruehl
4        331  Natural Language Processing    Alice Zhao

In [9]:
df = pd.read_csv('Data/course_offerings.csv')

In [10]:
df.head()

   course_id                  course_name    instructor
0        101              Intro to Python  Chris Bruehl
1        102                 Intro to SQL   John Pauler
2        201    Exploratory Data Analysis    Alice Zhao
3        301                   Algorithms  Chris Bruehl
4        331  Natural Language Processing    Alice Zhao

In [11]:
df.tail()

   course_id                  course_name    instructor
0        101              Intro to Python  Chris Bruehl
1        102                 Intro to SQL   John Pauler
2        201    Exploratory Data Analysis    Alice Zhao
3        301                   Algorithms  Chris Bruehl
4        331  Natural Language Processing    Alice Zhao

In [12]:
df.shape

(5, 3)

In [13]:
df.count()

course_id      5
course_name    5
instructor     5
dtype: int64

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   course_id    5 non-null      int64
 1   course_name  5 non-null      object
 2   instructor   5 non-null      object
dtypes: int64(1), object(2)
memory usage: 252.0+ bytes